apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
        // Asegúrate de que el mensaje sea tratado como una cadena de texto
        char message[BLE_NUS_MAX_DATA_LEN]; // +1 para el carácter nulo
        if (p_evt->params.rx_data.length < sizeof(message))
        {
            memcpy(message, p_evt->params.rx_data.p_data,
                   p_evt->params.rx_data.length);

            message[p_evt->params.rx_data.length] = '\0'; // Agregar terminador nulo

            // Imprime el mensaje recibido
            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Mensaje recibido: \x1b[0m%s",
                             message);

            // Verifica si el mensaje comienza con "111" par interpretar el comando
            if (p_evt->params.rx_data.length >= 5 && message[0] == '1' &&
                message[1] == '1' && message[2] == '1')
            {
                // Extrae el comando (los dos caracteres después de "111")
                char command[3] = {message[3], message[4],
                                   '\0'}; // Comando de 2 caracteres

                // Manejo de comandos con un switch-case
                switch (atoi(command)) // Convierte el comando a entero
                {

                    //================================================================================================
                    // COMANDOS REPETIDOR
                    //================================================================================================

                case 1: // Comando 01: Guardar MAC
                {
                    size_t mac_length = p_evt->params.rx_data.length - 5;
                    if (mac_length == 12) // Verifica que la longitud sea válida
                    {
                        for (size_t i = 0; i < 6; i++)
                        {
                            char byte_str[3]        = {message[5 + i * 2], message[6 + i * 2], '\0'};
                            custom_mac_addr_[5 - i] = (uint8_t)strtol(byte_str, NULL, 16);
                        }
                        NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 01 recibido: "
                                         "Cambiar MAC \x1b[0m");
                        NRF_LOG_RAW_INFO("\n> MAC recibida: "
                                         "%02X:%02X:%02X:%02X:%02X:%02X",
                                         custom_mac_addr_[5], custom_mac_addr_[4],
                                         custom_mac_addr_[3], custom_mac_addr_[2],
                                         custom_mac_addr_[1], custom_mac_addr_[0]);

                        // Guarda la MAC en la memoria flash y reinicia el
                        // dispositivo
                        save_mac_to_flash(custom_mac_addr_);
                    }
                    else
                    {
                        NRF_LOG_WARNING("Longitud de MAC inválida: %d", mac_length);
                    }
                    break;
                }

                case 2: // Comando 02: Muestra la MAC custom guardada en memoria
                {
                    uint8_t mac_print[6];
                    // Carga la MAC desde la memoria flash
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 02 recibido: Mostrando MAC guardada \x1b[0m");
                    load_mac_from_flash(mac_print);
                }
                break;

                case 3: // Comando 03: Reiniciar el dispositivo
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 03 recibido: Reiniciando dispositivo...\n\n\n\n");
                    nrf_delay_ms(1000);
                    NVIC_SystemReset();

                    break;

                case 4: // Guardar tiempo de encendido
                {
                    if (p_evt->params.rx_data.length >= 6) // Verifica que haya datos suficientes
                    {
                        char     time_str[4] = {message[5], message[6], message[7], '\0'};
                        uint32_t time_in_seconds __attribute__((aligned(4))) =
                            atoi(time_str) * 1000;
                        if (time_in_seconds <= 999000)
                        {
                            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 04 recibido: "
                                             "Cambiar tiempo de encendido \x1b[0m");
                            write_time_to_flash(TIEMPO_ENCENDIDO, time_in_seconds);
                        }
                        else
                        {
                            NRF_LOG_RAW_INFO("\nEl tiempo de encendido excede el maximo "
                                             "permitido (999 segundos).");
                        }
                    }
                    else
                    {
                        NRF_LOG_RAW_INFO("\nComando 04 recibido con datos insuficientes.");
                    }
                    break;
                }

                case 5: // Comando 05: Leer tiempo de encendido desde la memoria
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 05 recibido: Leer tiempo de encendido \x1b[0m");
                    uint32_t sleep_time_ms = read_time_from_flash(
                        TIEMPO_ENCENDIDO, DEFAULT_DEVICE_ON_TIME_MS);

                    break;
                }

                case 6: // Comando 06: Guardar tiempo de apagado
                {
                    if (p_evt->params.rx_data.length >= 6)
                    {
                        // Calcular la longitud del número (hasta 5 caracteres máximo)
                        size_t time_length = p_evt->params.rx_data.length - 5; // Restar "11106"
                        if (time_length > 5)
                            time_length = 5; // Máximo 5 caracteres

                        char time_str[6] = {0}; // Buffer para hasta 5 dígitos + terminador nulo
                        memcpy(time_str, &message[5], time_length);
                        time_str[time_length] = '\0';

                        uint32_t time_in_seconds __attribute__((aligned(4))) =
                            atoi(time_str) * 1000;
                        if (time_in_seconds <= 82500000) // Máximo 82500 segundos
                        {
                            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 06 recibido: "
                                             "Cambiar tiempo de dormido \x1b[0m");
                            NRF_LOG_RAW_INFO("\n> Tiempo configurado: %lu segundos (%s)",
                                             time_in_seconds / 1000, time_str);
                            write_time_to_flash(TIEMPO_SLEEP, time_in_seconds);
                        }
                        else
                        {
                            NRF_LOG_WARNING("El tiempo de dormido excede el máximo "
                                            "permitido (82500 segundos).");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Comando 06 recibido con datos insuficientes.");
                    }
                    break;
                }

                case 7: // Comando 07: Leer tiempo de dormido desde la memoria flash
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 07 recibido: Leer tiempo de dormido\x1b[0m");
                    uint32_t sleep_time_ms = read_time_from_flash(
                        TIEMPO_SLEEP, DEFAULT_DEVICE_SLEEP_TIME_MS);
                    break;
                }

