apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                case 8: // Comando 08: Escribe en la memoria flash la fecha, hora, formato YYYYMMDDHHMMSS
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 08 recibido: Guardar fecha y hora - YYYYMMDDHHMMSS\x1b[0m");
                    if (p_evt->params.rx_data.length >= 19)
                    {
                        const char *fecha_iso = &message[5];

                        datetime_t  dt;
                        if (sscanf(fecha_iso, "%4hu%2hhu%2hhu%2hhu%2hhu%2hhu", &dt.year,
                                   &dt.month, &dt.day, &dt.hour, &dt.minute,
                                   &dt.second) == 6)
                        {
                            NRF_LOG_RAW_INFO("\nFecha recibida: "
                                             "%04u-%02u-%02u %02u:%02u:%02u",
                                             dt.year, dt.month, dt.day, dt.hour, dt.minute,
                                             dt.second);

                            // Llamar a la función modificada
                            err_code = write_date_to_flash(&dt);

                            if (err_code != NRF_SUCCESS)
                            {
                                NRF_LOG_ERROR("Error guardando: 0x%X", err_code);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("Formato inválido. Se esperaba "
                                            "YYYYMMDDHHMMSS.");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Datos insuficientes. Se esperaban 14 dígitos");
                    }
                    break;
                }

                case 9: // Comando 09: Leer fecha y hora almacenada en flash
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 09 recibido: Leer fecha y hora\x1b[0m");

                    datetime_t dt = read_date_from_flash();

                    NRF_LOG_RAW_INFO(
                        "\n>> Fecha almacenada: %04u-%02u-%02u %02u:%02u:%02u", dt.year,
                        dt.month, dt.day, dt.hour, dt.minute, dt.second);

                    break;
                }

                case 10: // Guarda en la memoria el tiempo de encendido extendido
                {
                    if (p_evt->params.rx_data.length >= 6)
                    {
                        char     time_str[4] = {message[5], message[6], message[7], '\0'};
                        uint32_t time_in_seconds_extended __attribute__((aligned(4))) =
                            atoi(time_str) * 1000;
                        if (time_in_seconds_extended <= 666000)
                        {
                            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 10 recibido: "
                                             "Cambiar tiempo de encendido extendido\x1b[0m");
                            write_time_to_flash(TIEMPO_ENCENDIDO_EXTENDED, time_in_seconds_extended);
                        }
                        else
                        {
                            NRF_LOG_WARNING("El tiempo de encendido extendido excede el máximo "
                                            "permitido (666 segundos).");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Comando 10 recibido con datos insuficientes.");
                    }
                    break;
                }
                case 11: // Solicitar tiempo de encendido extendido
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 11 recibido: Solicitar tiempo de encendido extendido\x1b[0m");
                    uint32_t encendido_extendido_ms = read_time_from_flash(
                        TIEMPO_ENCENDIDO_EXTENDED, DEFAULT_DEVICE_ON_TIME_EXTENDED_MS);

                    break;
                }
                case 12: // Solicitar un registro de historial por ID
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 12 recibido: Solicitar registro de historial por ID\x1b[0m");
                    if (p_evt->params.rx_data.length > 5) // Verifica que haya datos suficientes
                    {
                        // Extrae el ID del registro como string (todo lo que sigue después de "11111")
                        size_t id_len    = p_evt->params.rx_data.length - 5;
                        char   id_str[8] = {0}; // Soporta hasta 7 dígitos, ajusta si necesitas más
                        if (id_len < sizeof(id_str))
                        {
                            memcpy(id_str, &message[5], id_len);
                            id_str[id_len]       = '\0';
                            uint16_t registro_id = (uint16_t)atoi(id_str);
                            // Llama a la función para solicitar el registro por ID
                            store_history registro_historial;
                            err_code = read_history_record_by_id(registro_id, &registro_historial);
                            if (err_code == NRF_SUCCESS)
                            {
                                NRF_LOG_RAW_INFO("\nSolicitud de registro %u enviada correctamente.", registro_id);
                                // Imprime el registro de historial
                                char titulo[41];
                                snprintf(titulo, sizeof(titulo), "Historial recibido \x1B[33m#%u\x1B[0m", registro_id);
                                print_history_record(&registro_historial, titulo);
                                NRF_LOG_FLUSH();
                            }
                            else
                            {
                                NRF_LOG_RAW_INFO("\nError al solicitar el registro %u: 0x%X", registro_id, err_code);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("ID de registro demasiado largo.");
                        }
                    }
                    break;
                }
                case 13: // Comando para borrar un historial segun el historial
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 13 recibido: Solicitar el borrado de un historial por ID\x1b[0m");

                    if (p_evt->params.rx_data.length > 5)
                    {
                        size_t id_len    = p_evt->params.rx_data.length - 5;
                        char   id_str[8] = {0};
                        uint16_t registro_id = (uint16_t)atoi(id_str);

                        err_code = delete_history_record_by_id(registro_id);
                        if (err_code == NRF_SUCCESS)
                        {
                            NRF_LOG_RAW_INFO("\nHistorial %u borrado con exito!", registro_id);
                        }
                        else
                        {
                            NRF_LOG_RAW_INFO("\nError al borrar el historial %u.", registro_id);
                        }
                    }

                    break;
                }

                case 14: // Pide una lectura de todos los historiales
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 14: Solicitud del historial completo\x1b[0m");
                    // Llama a la función para solicitar el historial completo
                    send_all_history();

                    break;
                }
                case 99: // Comando para borrar todos los historiales
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 99 recibido: Borrar todos los historiales\x1b[0m");

                    delete_all_history();
                    break;
                }

